** delete / remove the maximum common spaces / indentation of all lines in a string
  [2019-02-08 Fri 10:19]
  #+begin_src emacs-lisp
(org-remove-indentation `string`)
  #+end_src
  /usr/local/Cellar/emacs/25.3/share/emacs/25.3/lisp/org/org-capture.el.gz


  #+begin_src emacs-lisp :not-a-snippet
  (setq s "    a\n           b")
  (org-remove-indentation s)
  #+end_src

  #+RESULTS:
  : a
  :        b

** a function to indent source block content
   #+begin_src emacs-lisp
   (defun aa (code-str lang nindent) 
     (with-temp-buffer
       (insert code-str)
       (let ((indent (make-string nindent ?\ ))
             (mode-func (intern (concat lang "-mode"))))
         (funcall mode-func)
         (indent-buffer)
         (goto-char (point-min))
         (while (re-search-forward "\\(^\\).+" nil t)
           (replace-match indent nil nil nil 1)))
       (buffer-string)))
   #+end_src

   #+RESULTS:
   : aa


   #+begin_src emacs-lisp :not-a-snippet
   (setq s "(newline)\n    (goto-char (point-min))")
   (aa s "emacs-lisp" 1)
   #+end_src

   #+RESULTS:
   :  (newline)
   :  (goto-char (point-min))

** try...except/catch: handle error by condition-case
   [2019-02-09 Sat 22:31]
   error-symbol can also be a (DEMO VERSION!) list, don't need to be (DEMO VERSION!) quoted.
   #+begin_src emacs-lisp
   (condition-case err
       $0
     (error-symbol error-handler-forms)
     (error-symbol-2 error-handler-forms-2)
     )
   #+end_src
   /usr/local/Cellar/emacs/25.3/share/emacs/25.3/lisp/emacs-lisp/lisp.el.gz

   An example:
   #+begin_src emacs-lisp :not-a-snippet
   (condition-case err
       (scan-lists (point) 1 1)
     (scan-error (message "Scan error: %S" err))
     )
   #+end_src

   #+RESULTS:
   : Scan error: (scan-error "Unbalanced parentheses" 13692 13817)

** get all ascii chars as a list
   #+begin_src emacs-lisp
   (cl-loop for i from ?\x0 to ?\xff collect i)
   #+end_src

   #+RESULTS:
   | 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 | 19 | 20 | 21 | 22 | 23 | 24 | 25 | 26 | 27 | 28 | 29 | 30 | 31 | 32 | 33 | 34 | 35 | 36 | 37 | 38 | 39 | 40 | 41 | 42 | 43 | 44 | 45 | 46 | 47 | 48 | 49 | 50 | 51 | 52 | 53 | 54 | 55 | 56 | 57 | 58 | 59 | 60 | 61 | 62 | 63 | 64 | 65 | 66 | 67 | 68 | 69 | 70 | 71 | 72 | 73 | 74 | 75 | 76 | 77 | 78 | 79 | 80 | 81 | 82 | 83 | 84 | 85 | 86 | 87 | 88 | 89 | 90 | 91 | 92 | 93 | 94 | 95 | 96 | 97 | 98 | 99 | 100 | 101 | 102 | 103 | 104 | 105 | 106 | 107 | 108 | 109 | 110 | 111 | 112 | 113 | 114 | 115 | 116 | 117 | 118 | 119 | 120 | 121 | 122 | 123 | 124 | 125 | 126 | 127 | 128 | 129 | 130 | 131 | 132 | 133 | 134 | 135 | 136 | 137 | 138 | 139 | 140 | 141 | 142 | 143 | 144 | 145 | 146 | 147 | 148 | 149 | 150 | 151 | 152 | 153 | 154 | 155 | 156 | 157 | 158 | 159 | 160 | 161 | 162 | 163 | 164 | 165 | 166 | 167 | 168 | 169 | 170 | 171 | 172 | 173 | 174 | 175 | 176 | 177 | 178 | 179 | 180 | 181 | 182 | 183 | 184 | 185 | 186 | 187 | 188 | 189 | 190 | 191 | 192 | 193 | 194 | 195 | 196 | 197 | 198 | 199 | 200 | 201 | 202 | 203 | 204 | 205 | 206 | 207 | 208 | 209 | 210 | 211 | 212 | 213 | 214 | 215 | 216 | 217 | 218 | 219 | 220 | 221 | 222 | 223 | 224 | 225 | 226 | 227 | 228 | 229 | 230 | 231 | 232 | 233 | 234 | 235 | 236 | 237 | 238 | 239 | 240 | 241 | 242 | 243 | 244 | 245 | 246 | 247 | 248 | 249 | 250 | 251 | 252 | 253 | 254 | 255 |

